[{
  "_id": {
    "$oid": "68fb7ec94736924976f75794"
  },
  "title": {
    "en": "DevFolio",
    "ar": "DevFolio"
  },
  "description": {
    "en": "1.Responsive Design: DevFolio adapts smoothly to all devices, ensuring your portfolio looks stunning on desktops, tablets, and mobiles.\r\n\r\n2.Easy Customization: Personalize your portfolio by customizing sections to highlight your projects, skills, and achievements. Effortlessly update content and images.\r\n\r\n3.Integrated Contact Form: Engage visitors with a built-in contact form, enabling direct communication from your portfolio.\r\n\r\n4.Social Media Integration: Seamlessly integrate your social media profiles, including LinkedIn and GitHub, to enhance networking opportunities.\r\n\r\n5.SEO Friendly: DevFolio is optimized for search engines, ensuring your portfolio stands out to recruiters and potential clients.",
    "ar": "تصميم متجاوب: يتكيف بسلاسة مع جميع الأجهزة، ليظهر البورتفوليو بأفضل شكل على شاشات الكمبيوتر، الأجهزة اللوحية، والهواتف المحمولة.\r\n\r\nسهولة التخصيص: يمكنك تعديل الأقسام بكل سهولة لعرض مشاريعك، مهاراتك، وإنجازاتك. كما يمكنك تحديث المحتوى والصور بسرعة وبدون تعقيد.\r\n\r\nنموذج تواصل مدمج: يتيح لزوار الموقع التواصل معك مباشرة من خلال نموذج رسائل مدمج داخل البورتفوليو.\r\n\r\nدمج مع وسائل التواصل الاجتماعي: يوفّر إمكانية ربط حساباتك على منصات مثل LinkedIn وGitHub لتعزيز فرص التواصل والظهور المهني.\r\n\r\nصديق لمحركات البحث (SEO Friendly): القالب مُحسّن لمحركات البحث، ليساعد بورتفوليوك على الظهور أمام العملاء المحتملين ومسؤولي التوظيف."
  },
  "shortDescription": {
    "en": "DevFolio is a responsive portfolio landing page template perfect for showcasing your skills, projects, and experience. Its modern and clean design ensures a professional presentation.",
    "ar": "DevFolio هو قالب صفحة هبوط (Landing Page) لعرض البورتفوليو، يتميز بتصميم متجاوب مثالي لعرض مهاراتك، مشاريعك، وخبراتك. تصميمه العصري والنظيف يضمن تقديم ملفك الشخصي بشكل احترافي ومميز."
  },
  "image": "https://res.cloudinary.com/dm0nt36nw/image/upload/v1761312378/5437b478-3515-404a-8400-af884fd72765.png",
  "images": [],
  "technologies": [
    "HTML5",
    "CSS3",
    "ES6+",
    "BootStrap"
  ],
  "categories": [
    {
      "$oid": "68fa4b83431201596530a536"
    }
  ],
  "liveUrl": "https://zyadwalid1.github.io/Devfolio-Route/",
  "githubUrl": "https://github.com/Zyadwalid1/Devfolio-Route",
  "featured": false,
  "order": 0,
  "status": "completed",
  "createdAt": {
    "$date": "2025-10-24T13:27:37.250Z"
  },
  "updatedAt": {
    "$date": "2025-10-24T13:50:12.608Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "68fb81c24736924976f757ad"
  },
  "title": {
    "en": "Mealify",
    "ar": "Mealify"
  },
  "description": {
    "en": "Captivating design with attractive background and shake animation\r\nChefs section with links to their social media profiles\r\nGallery section showcasing delectable dishes\r\nContact section with a sleek and user-friendly form\r\nSmooth animations and transitions throughout the website\r\nResponsive design for optimal viewing on different devices\r\nDark mode using the :has pseudo-class and :checked selector\r\nDeveloped using Flexbox and grid for flexible and intuitive layouts",
    "ar": "تصميم جذّاب بخلفية ملفتة وحركة اهتزاز (Shake Animation)\r\n\r\nقسم خاص بالطهاة مع روابط لحساباتهم على مواقع التواصل الاجتماعي\r\n\r\nقسم المعرض لعرض أشهى وأجمل الأطباق\r\n\r\nنموذج تواصل أنيق وسهل الاستخدام للتفاعل مع الزوار\r\n\r\nحركات وانتقالات سلسة تضيف تجربة بصرية مميزة\r\n\r\nتصميم متجاوب يعمل بكفاءة على جميع الأجهزة\r\n\r\nوضع الداكن (Dark Mode) باستخدام :has و :checked في الـ CSS\r\n\r\nتم التطوير باستخدام Flexbox و CSS Grid لتخطيطات مرنة وسهلة التنظي"
  },
  "shortDescription": {
    "en": "Experience the culinary delights at Mealify, a captivating restaurant web page template. With its attractive design, smooth animations, and enticing features, Mealify brings the dining experience to life.",
    "ar": "استمتع بتجربة الطهي مع Mealify، قالب موقع مطعم جذاب ينقل عالم الطعام إلى الشاشة بأسلوب مميز. بفضل تصميمه الملفت، والحركات السلسة، والمميزات المشوّقة، يجعل Mealify تجربة تصفح الموقع أشبه بزيارة حقيقية للمطعم."
  },
  "image": "https://res.cloudinary.com/dm0nt36nw/image/upload/v1761313151/75e68e94-8c77-450b-ba09-f29725353967.png",
  "images": [],
  "technologies": [
    "HTML5",
    "CSS3",
    "ES6+",
    "Bootstrap"
  ],
  "categories": [
    {
      "$oid": "68fa4b83431201596530a536"
    }
  ],
  "liveUrl": "https://zyadwalid1.github.io/Mealify-route/",
  "githubUrl": "https://github.com/Zyadwalid1/Mealify-route",
  "featured": false,
  "order": 0,
  "status": "completed",
  "createdAt": {
    "$date": "2025-10-24T13:40:18.754Z"
  },
  "updatedAt": {
    "$date": "2025-10-24T13:42:11.412Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "68fb83eb4736924976f757d8"
  },
  "title": {
    "en": "Daniels Template",
    "ar": "Daniels Template"
  },
  "description": {
    "en": "Minimalistic Design: The template boasts a clean, modern design that puts your content in the spotlight.\r\n\r\nEasy Customization: Developed with HTML 5, CSS, and Bootstrap, this template is easily customizable to align with your unique style and branding.\r\n\r\nStunning Animations: Experience the magic of typing animations and transitions, adding an elegant touch to your website.\r\n\r\nResponsive and Cross-Browser Compatible: The template is fully responsive, ensuring a seamless user experience across all devices, and it's compatible with all major web browsers.\r\n\r\nElevate your online presence with the Daniels-Personal Website Template. Showcase your portfolio with style and professionalism, and leave a memorable impression on your visitors.",
    "ar": "تصميم بسيط وأنيق: يتميز بتصميم عصري ونظيف يضع محتواك في المقدّمة ويجعل التركيز على أعمالك وإنجازاتك.\r\n\r\nسهل التخصيص: تم تطوير القالب باستخدام HTML5 وCSS وBootstrap، مما يتيح لك تخصيصه بسهولة ليتناسب مع هويتك البصرية وأسلوبك الخاص.\r\n\r\nحركات مذهلة: يحتوي على تأثيرات كتابة (Typing Animation) وانتقالات سلسة تضيف لمسة من الحيوية والاحترافية للموقع.\r\n\r\nمتجاوب ومتوافق مع جميع المتصفحات: القالب يعمل بشكل ممتاز على مختلف الأجهزة (كمبيوتر، تابلت، موبايل)، ويدعم جميع المتصفحات الشهيرة بدون مشاكل.\r\n\r\nارتقِ بحضورك على الإنترنت مع قالب Daniels.\r\nاعرض أعمالك باحترافية، واترك انطباعاً قوياً في ذهن كل من يزور موقعك."
  },
  "shortDescription": {
    "en": "Create a captivating online presence with the Daniels-Personal Website Template. This template is meticulously designed to showcase your portfolio in a stylish and professional manner.",
    "ar": "تم تصميم هذا القالب بعناية ليعرض أعمالك وبورتفوليوك بأسلوب احترافي وأنيق يعكس شخصيتك ومهاراتك."
  },
  "image": "https://res.cloudinary.com/dm0nt36nw/image/upload/v1761313708/178f4abd-b963-4d3b-9b14-8acc01f0e41c.png",
  "images": [],
  "technologies": [
    "HTML5",
    "CSS3",
    "Bootstrap"
  ],
  "categories": [
    {
      "$oid": "68fa4b83431201596530a536"
    }
  ],
  "liveUrl": "https://zyadwalid1.github.io/Daniels-Exam-Route/",
  "githubUrl": "https://github.com/Zyadwalid1/Daniels-Exam-Route",
  "featured": false,
  "order": 0,
  "status": "completed",
  "createdAt": {
    "$date": "2025-10-24T13:49:31.949Z"
  },
  "updatedAt": {
    "$date": "2025-10-24T13:49:31.949Z"
  },
  "__v": 0
}]